CITIES = {
    1: {
        "name": "🏚 Биробиджан (Россия)",
        "bonus": 0.0,  # Бонус к доходу в процентах
        "move_cost": 0  # Стоимость переезда
    },
    2: {
        "name": "🏘 Тула (Россия)",
        "bonus": 0.01,
        "move_cost": 10000
    },
    3: {
        "name": "🌿 Гомель (Беларусь)",
        "bonus": 0.02,
        "move_cost": 25000
    },
    4: {
        "name": "🌊 Одесса (Украина)",
        "bonus": 0.03,
        "move_cost": 50000
    },
    5: {
        "name": "🏞 Алматы (Казахстан)",
        "bonus": 0.04,
        "move_cost": 100000
    },
    6: {
        "name": "🏯 Тбилиси (Грузия)",
        "bonus": 0.05,
        "move_cost": 250000
    },
    7: {
        "name": "🏖 Сочи (Россия)",
        "bonus": 0.06,
        "move_cost": 500000
    },
    8: {
        "name": "🏝 Бали (Индонезия)",
        "bonus": 0.07,
        "move_cost": 1000000
    },
    9: {
        "name": "🏙 Дубай (ОАЭ)",
        "bonus": 0.08,
        "move_cost": 2000000
    },
    10: {
        "name": "🌇 Барселона (Испания)",
        "bonus": 0.09,
        "move_cost": 3000000
    },
    11: {
        "name": "🌉 Сан-Франциско (США)",
        "bonus": 0.1,
        "move_cost": 4500000
    },
    12: {
        "name": "🌃 Токио (Япония)",
        "bonus": 0.11,
        "move_cost": 6000000
    },
    13: {
        "name": "🌆 Сингапур",
        "bonus": 0.12,
        "move_cost": 8000000
    },
    14: {
        "name": "🗽 Нью-Йорк (США)",
        "bonus": 0.13,
        "move_cost": 10000000
    },
    15: {
        "name": "🏰 Париж (Франция)",
        "bonus": 0.14,
        "move_cost": 13000000
    },
    16: {
        "name": "🏖 Майами (США)",
        "bonus": 0.15,
        "move_cost": 16000000
    },
    17: {
        "name": "🏛 Рим (Италия)",
        "bonus": 0.16,
        "move_cost": 20000000
    },
    18: {
        "name": "🌉 Сидней (Австралия)",
        "bonus": 0.17,
        "move_cost": 25000000
    },
    19: {
        "name": "🌇 Гонконг (Китай)",
        "bonus": 0.18,
        "move_cost": 30000000
    },
    20: {
        "name": "🏜 Лас-Вегас (США)",
        "bonus": 0.19,
        "move_cost": 40000000
    },
    21: {
        "name": "🌴 Лос-Анджелес (США)",
        "bonus": 0.20,
        "move_cost": 50000000
    },
    22: {
        "name": "🏦 Лондон (Великобритания)",
        "bonus": 0.21,
        "move_cost": 60000000
    },
    23: {
        "name": "🏢 Чикаго (США)",
        "bonus": 0.22,
        "move_cost": 70000000
    },
    24: {
        "name": "🏞 Ванкувер (Канада)",
        "bonus": 0.23,
        "move_cost": 85000000
    },
    25: {
        "name": "🌇 Сеул (Южная Корея)",
        "bonus": 0.24,
        "move_cost": 90000000
    },
    26: {
        "name": "🏙 Доха (Катар)",
        "bonus": 0.245,
        "move_cost": 95000000
    },
    27: {
        "name": "🌊 Кейптаун (ЮАР)",
        "bonus": 0.247,
        "move_cost": 97000000
    },
    28: {
        "name": "🌟 Шанхай (Китай)",
        "bonus": 0.248,
        "move_cost": 98000000
    },
    29: {
        "name": "🏖 Буэнос-Айрес (Аргентина)",
        "bonus": 0.249,
        "move_cost": 99000000
    },
    30: {
        "name": "👑 Женева (Швейцария)",
        "bonus": 0.25,
        "move_cost": 100000000
    }
}