API_TOKEN = "7624169303:AAHISwiPuWbCN0lnShjN_apQYvH_4ePQQSI"  # Получить у @BotFather
ADMIN_ID = 437122514     # Ваш Telegram ID (узнать у @userinfobot)
BOT_USERNAME = "TTTopGameBot"  # Например: "my_game_bot" для t.me/my_game_bot

MYSQL_HOST = "31.31.198.9"  # Хост вашего MySQL
MYSQL_PORT = 3310                 # Порт (обычно 3306)
MYSQL_USER = "u3029780_bot"       # Имя пользователя
MYSQL_PASSWORD = "vadimstrekozov0022"  # Пароль
MYSQL_DATABASE = "u3029780_bot"  # Имя базы данных

RANKS = {
    1: "Новичок",
    2: "Неудачник",
    3: "Подмастерье",
    4: "Работяга",
    5: "Искатель удачи",
    6: "Знаток",
    7: "Умелец",
    8: "Продвинутый",
    9: "Амбициозный",
    10: "Предприниматель",
    11: "Профессионал",
    12: "Авторитет",
    13: "Инвестор",
    14: "Стратег",
    15: "Лидер мнений",
    16: "Вдохновитель",
    17: "Магнат",
    18: "Легенда бизнеса",
    19: "Миллиардер",
    20: "Титан успеха",

    # Донатные ранги
    21: "Бронзовый VIP",
    22: "Серебряный VIP",
    23: "Золотой VIP",
    24: "Платиновый VIP",
    25: "Алмазный VIP",

    # Специальные ранги
    26: "Модератор",
    27: "Администратор",
    28: "Куратор",
    29: "Помощник хозяина",
    30: "Создатель"
}

DAILY_BONUSES = [50, 100, 150, 200, 250, 300, 500]

EXPERIENCE_PER_1000_SOLIX = 10  # Опыт за каждые 1000 solix

